Revit 2027 API
StructuralSectionSigmaProfile.BendWidth Property
 Bend segment width.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BendWidth { get; set; }
Public Property BendWidth As Double
	Get
	Set
public:
property double BendWidth {
	double get ();
	void set (double value);
}
member BendWidth : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionSigmaProfile Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace